In [2]:
import sys, os
import pandas as pd
sys.path.insert(0,'F:/BitCoinDev/')
os.chdir('/BitCoinDev/BitCoinDev_Pycharm/')
os.path.abspath(os.curdir)

'F:\\BitCoinDev\\BitCoinDev_Pycharm'

In [3]:
from autotrading.db.mongodb import mongodb_handler
mongodb = mongodb_handler.MongoDBHandler("local","coiner","price_info")

query = {
    "cointype":"ADA",
    "Currency_Trade":"Bithumb",
    "year" : 2018,
    "month" : 7
}
result = mongodb.find_items(query)

result = list(result)

## 데이터프레임(DataFrame)
* pandas에서 제공하는 자료구조 중 가장 많이 쓰이는 자료구조이며, pandas가 제공하는 모든 기능의 핵심이다.

### 1. 테이블 형태로 먼저 확인해보자

In [4]:
pd.set_option('precision',12)

df = pd.DataFrame(result)
df

,Currency_Trade,_id,amount,cointype,cont_no,day,hour,minute,month,price,second,timestamp,total,transaction_date,type,units_traded,year
0,Bithumb,5b41d6980f1cc2461c60140f,10695.1428,ADA,167057,8,18,16,7,182,42,1531041402.0,1946516,2018-07-08 18:16:42,bid,10695.1428,2018
1,Bithumb,5b41d6980f1cc2461c601410,225.4474,ADA,167056,8,18,15,7,182,52,1531041352.0,41031,2018-07-08 18:15:52,bid,225.4474,2018
2,Bithumb,5b41d6980f1cc2461c601411,95.888,ADA,167055,8,18,15,7,182,52,1531041352.0,17452,2018-07-08 18:15:52,bid,95.888,2018
3,Bithumb,5b41d72b0f1cc2056841e0f7,102.0,ADA,167058,8,18,18,7,181,38,1531041518.0,18462,2018-07-08 18:18:38,ask,102.0,2018
4,Bithumb,5b41d72b0f1cc2056841e0f8,10695.1428,ADA,167057,8,18,16,7,182,42,1531041402.0,1946516,2018-07-08 18:16:42,bid,10695.1428,2018
5,Bithumb,5b41d72b0f1cc2056841e0f9,225.4474,ADA,167056,8,18,15,7,182,52,1531041352.0,41031,2018-07-08 18:15:52,bid,225.4474,2018
6,Bithumb,5b41d9500f1cc246d8fc702c,12061.93956,ADA,167072,8,18,28,7,182,11,1531042091.0,2195273,2018-07-08 18:28:11,bid,12061.93956,2018
7,Bithumb,5b41d9500f1cc246d8fc702d,21578.6768,ADA,167071,8,18,27,7,181,54,1531042074.0,3905741,2018-07-08 18:27:54,ask,21578.6768,2018
8,Bithumb,5b41d9500f1cc246d8fc702e,2366.0718,ADA,167070,8,18,27,7,181,54,1531042074.0,428259,2018-07-08 18:27:54,ask,2366.0718,2018
9,Bithumb,5b41e8bc0f1cc220e028ff90,911.7226,ADA,167145,8,19,32,7,181,12,1531045932.0,165022,2018-07-08 19:32:12,ask,911.7226,2018
10,Bithumb,5b41e8bc0f1cc220e028ff91,1041.0824,ADA,167144,8,19,30,7,182,12,1531045812.0,189477,2018-07-08 19:30:12,bid,1041.0824,2018
11,Bithumb,5b41e8bc0f1cc220e028ff92,32.967033,ADA,167143,8,19,29,7,182,50,1531045790.0,6000,2018-07-08 19:29:50,bid,32.967033,2018
12,Bithumb,5b41e9300f1cc24828078b74,408.2028,ADA,167147,8,19,36,7,181,27,1531046187.0,73885,2018-07-08 19:36:27,ask,408.2028,2018
13,Bithumb,5b41e9300f1cc24828078b75,1053.0074,ADA,167146,8,19,36,7,181,10,1531046170.0,190594,2018-07-08 19:36:10,ask,1053.0074,2018
14,Bithumb,5b41e9300f1cc24828078b76,911.7226,ADA,167145,8,19,32,7,181,12,1531045932.0,165022,2018-07-08 19:32:12,ask,911.7226,2018

### 2. 인덱스는 'Transaction' 칼럼은 'amount', 'price' 인놈만 확인해보자

In [5]:
df = pd.DataFrame(result, index = [item["transaction_date"] for item in result], columns=['amount', 'price'])
df

                          amount price
2018-07-08 18:16:42   10695.1428   182
2018-07-08 18:15:52     225.4474   182
2018-07-08 18:15:52       95.888   182
2018-07-08 18:18:38        102.0   181
2018-07-08 18:16:42   10695.1428   182
2018-07-08 18:15:52     225.4474   182
2018-07-08 18:28:11  12061.93956   182
2018-07-08 18:27:54   21578.6768   181
2018-07-08 18:27:54    2366.0718   181
2018-07-08 19:32:12     911.7226   181
2018-07-08 19:30:12    1041.0824   182
2018-07-08 19:29:50    32.967033   182
2018-07-08 19:36:27     408.2028   181
2018-07-08 19:36:10    1053.0074   181
2018-07-08 19:32:12     911.7226   181

### 3. 인덱스는 지정안하고 __amount__, __price__,__transaction__ 칼럼만 지정해보자
   ### 또 __amount__는 수량, __price__는 가격이므로 데이터 타입을 float타입으로 바꾸겠다.

In [6]:
df = pd.DataFrame(result, columns=['amount', 'price','transaction_date'])
df['amount'] = df['amount'].astype(float)
df['price'] = df['price'].astype(float)
df

                amount  price     transaction_date
0   10695.142800000000  182.0  2018-07-08 18:16:42
1     225.447400000000  182.0  2018-07-08 18:15:52
2      95.888000000000  182.0  2018-07-08 18:15:52
3     102.000000000000  181.0  2018-07-08 18:18:38
4   10695.142800000000  182.0  2018-07-08 18:16:42
5     225.447400000000  182.0  2018-07-08 18:15:52
6   12061.939560000001  182.0  2018-07-08 18:28:11
7   21578.676800000001  181.0  2018-07-08 18:27:54
8    2366.071800000000  181.0  2018-07-08 18:27:54
9     911.722600000000  181.0  2018-07-08 19:32:12
10   1041.082400000000  182.0  2018-07-08 19:30:12
11     32.967033000000  182.0  2018-07-08 19:29:50
12    408.202800000000  181.0  2018-07-08 19:36:27
13   1053.007400000000  181.0  2018-07-08 19:36:10
14    911.722600000000  181.0  2018-07-08 19:32:12

### 4. __price__ 칼럼만 선택해보자

In [7]:
df['price']

0     182.0
1     182.0
2     182.0
3     181.0
4     182.0
5     182.0
6     182.0
7     181.0
8     181.0
9     181.0
10    182.0
11    182.0
12    181.0
13    181.0
14    181.0
Name: price, dtype: float64

### 5. 레이블로 칼럼을 선택하는 loc에 대해 알아보자
* 레이블 10에 해당하는 행의 칼럼명과 값이 시리즈 형태로 반환된다.

In [8]:
df.loc[10]

amount                        1041.0824
price                               182
transaction_date    2018-07-08 19:30:12
Name: 10, dtype: object

### 6. 숫자 위치로 행을 선택하는 iloc

In [9]:
df.iloc[10]

amount                        1041.0824
price                               182
transaction_date    2018-07-08 19:30:12
Name: 10, dtype: object

### 7. __price__ 와 __amount__를 2배로 만드는 수량,가격 각각 double_price, double_amount 칼럼명을 추가해보자

In [11]:

df['double_price'] = df['price'] * 2

df

                amount  price     transaction_date  double_price
0   10695.142800000000  182.0  2018-07-08 18:16:42         364.0
1     225.447400000000  182.0  2018-07-08 18:15:52         364.0
2      95.888000000000  182.0  2018-07-08 18:15:52         364.0
3     102.000000000000  181.0  2018-07-08 18:18:38         362.0
4   10695.142800000000  182.0  2018-07-08 18:16:42         364.0
5     225.447400000000  182.0  2018-07-08 18:15:52         364.0
6   12061.939560000001  182.0  2018-07-08 18:28:11         364.0
7   21578.676800000001  181.0  2018-07-08 18:27:54         362.0
8    2366.071800000000  181.0  2018-07-08 18:27:54         362.0
9     911.722600000000  181.0  2018-07-08 19:32:12         362.0
10   1041.082400000000  182.0  2018-07-08 19:30:12         364.0
11     32.967033000000  182.0  2018-07-08 19:29:50         364.0
12    408.202800000000  181.0  2018-07-08 19:36:27         362.0
13   1053.007400000000  181.0  2018-07-08 19:36:10         362.0
14    911.722600000000  181.0  2018-07-08 19:32:12         362.0

### 8. Insert 메서드를 이용해서 amount 와 price칼럼 사이에 amount의 2배로 만든 'double_amount' 칼럼을 추가해보자

In [12]:

# insert 메서드를 이용해서 amount 와 price칼럼 사이에 amount의 2배로 만든 double_amount이름을 추가해보자
df.insert(0,'double_amount',df['amount']*2)
df

,double_amount,amount,price,transaction_date,double_price
0,21390.285599999999,10695.142800000000,182.0,2018-07-08 18:16:42,364.0
1,450.894800000000,225.447400000000,182.0,2018-07-08 18:15:52,364.0
2,191.776000000000,95.888000000000,182.0,2018-07-08 18:15:52,364.0
3,204.000000000000,102.000000000000,181.0,2018-07-08 18:18:38,362.0
4,21390.285599999999,10695.142800000000,182.0,2018-07-08 18:16:42,364.0
5,450.894800000000,225.447400000000,182.0,2018-07-08 18:15:52,364.0
6,24123.879120000001,12061.939560000001,182.0,2018-07-08 18:28:11,364.0
7,43157.353600000002,21578.676800000001,181.0,2018-07-08 18:27:54,362.0
8,4732.143600000000,2366.071800000000,181.0,2018-07-08 18:27:54,362.0
9,1823.445200000000,911.722600000000,181.0,2018-07-08 19:32:12,362.0
10,2082.164800000000,1041.082400000000,182.0,2018-07-08 19:30:12,364.0
11,65.934066000000,32.967033000000,182.0,2018-07-08 19:29:50,364.0
12,816.405600000000,408.202800000000,181.0,2018-07-08 19:36:27,362.0
13,2106.014800000000,1053.007400000000,181.0,2018-07-08 19:36:10,362.0
14,1823.445200000000,911.722600000000,181.0,2018-07-08 19:32:12,362.0

### 9. '__double_price__' 칼럼을 삭제해 보자
* pop은 해당 칼럼을 시리즈로 반환하고 삭제한다.

In [13]:
# 'double_price' 칼럼을 삭제해 보자
# pop은 해당 칼럼을 시리즈로 반환하고 삭제한다.
double_price = df.pop('double_price')
double_price

0     364.0
1     364.0
2     364.0
3     362.0
4     364.0
5     364.0
6     364.0
7     362.0
8     362.0
9     362.0
10    364.0
11    364.0
12    362.0
13    362.0
14    362.0
Name: double_price, dtype: float64

### 10. del은 삭제만 한다.

In [14]:
# del은 삭제만 한다.
del df['double_amount']
df

                amount  price     transaction_date
0   10695.142800000000  182.0  2018-07-08 18:16:42
1     225.447400000000  182.0  2018-07-08 18:15:52
2      95.888000000000  182.0  2018-07-08 18:15:52
3     102.000000000000  181.0  2018-07-08 18:18:38
4   10695.142800000000  182.0  2018-07-08 18:16:42
5     225.447400000000  182.0  2018-07-08 18:15:52
6   12061.939560000001  182.0  2018-07-08 18:28:11
7   21578.676800000001  181.0  2018-07-08 18:27:54
8    2366.071800000000  181.0  2018-07-08 18:27:54
9     911.722600000000  181.0  2018-07-08 19:32:12
10   1041.082400000000  182.0  2018-07-08 19:30:12
11     32.967033000000  182.0  2018-07-08 19:29:50
12    408.202800000000  181.0  2018-07-08 19:36:27
13   1053.007400000000  181.0  2018-07-08 19:36:10
14    911.722600000000  181.0  2018-07-08 19:32:12

### 11. 데이터 프레임의 컬럼명만 출력해보자.

In [18]:
df.columns

Index(['amount', 'price', 'transaction_date'], dtype='object')

### 12. 데이터 프레임의 값만 출력해보자

In [22]:
df.values

array([[10695.1428, 182.0, '2018-07-08 18:16:42'],
       [225.4474, 182.0, '2018-07-08 18:15:52'],
       [95.888, 182.0, '2018-07-08 18:15:52'],
       [102.0, 181.0, '2018-07-08 18:18:38'],
       [10695.1428, 182.0, '2018-07-08 18:16:42'],
       [225.4474, 182.0, '2018-07-08 18:15:52'],
       [12061.93956, 182.0, '2018-07-08 18:28:11'],
       [21578.6768, 181.0, '2018-07-08 18:27:54'],
       [2366.0718, 181.0, '2018-07-08 18:27:54'],
       [911.7226, 181.0, '2018-07-08 19:32:12'],
       [1041.0824, 182.0, '2018-07-08 19:30:12'],
       [32.967033, 182.0, '2018-07-08 19:29:50'],
       [408.2028, 181.0, '2018-07-08 19:36:27'],
       [1053.0074, 181.0, '2018-07-08 19:36:10'],
       [911.7226, 181.0, '2018-07-08 19:32:12']], dtype=object)

### 13. 데이터 프레임의 상위 2개 행만 출력해보자

In [25]:

df.head(2)

       amount  price     transaction_date
0  10695.1428  182.0  2018-07-08 18:16:42
1    225.4474  182.0  2018-07-08 18:15:52

### 14. 테이터 프레임의 하위 2개 행만 출력해보자

In [28]:
df.tail(2)

       amount  price     transaction_date
13  1053.0074  181.0  2018-07-08 19:36:10
14   911.7226  181.0  2018-07-08 19:32:12

## 기본적인 함수를 이용한 데이터 가공
* 데이터 프레임에서 기본적으로 제공하는 함수들 중 중요한 몇가지를 이용해서 데이터를 가공해 보자

### 1. df의 모든 칼럼에 1.05가 곱해진 df_2를 확인해보자

In [39]:
df = pd.DataFrame(result,columns=['amount', 'price','timestamp'])
df['amount'] = df['amount'].astype(float)
df['price'] = df['price'].astype(float)
df['timestamp'] = df['timestamp'].astype(float)
df_2 = df * 1.05
df_2

                amount   price           timestamp
0   11229.899939999999  191.10  1.607593472100e+09
1     236.719770000000  191.10  1.607593419600e+09
2     100.682400000000  191.10  1.607593419600e+09
3     107.100000000000  190.05  1.607593593900e+09
4   11229.899939999999  191.10  1.607593472100e+09
5     236.719770000000  191.10  1.607593419600e+09
6   12665.036538000002  191.10  1.607594195550e+09
7   22657.610640000003  190.05  1.607594177700e+09
8    2484.375390000000  190.05  1.607594177700e+09
9     957.308730000000  190.05  1.607598228600e+09
10   1093.136520000000  191.10  1.607598102600e+09
11     34.615384650000  191.10  1.607598079500e+09
12    428.612940000000  190.05  1.607598496350e+09
13   1105.657770000000  190.05  1.607598478500e+09
14    957.308730000000  190.05  1.607598228600e+09

### 2. df 와 df_2를 이용하여 서로 다른 데이터프레임 간의 데이터 가공에 대해 알아보자
* 두 개의 데이터프레임을 더해 보자. + 연산자나 데이터프레임의 add메서드를 이용하면 된다.
* 연산자 외에도 기본적인 산술 연산자에 대응하는 메서드가 있다.
> * add() :  + 
> * sub() :  -
> * mul() :  *
> * div() : /

In [45]:
df + df_2
df.add(df_2)

                amount   price           timestamp
0   21925.042739999997  373.10  3.138634874100e+09
1     462.167170000000  373.10  3.138634771600e+09
2     196.570400000000  373.10  3.138634771600e+09
3     209.100000000000  371.05  3.138635111900e+09
4   21925.042739999997  373.10  3.138634874100e+09
5     462.167170000000  373.10  3.138634771600e+09
6   24726.976098000003  373.10  3.138636286550e+09
7   44236.287440000000  371.05  3.138636251700e+09
8    4850.447190000001  371.05  3.138636251700e+09
9    1869.031330000000  371.05  3.138644160600e+09
10   2134.218920000000  373.10  3.138643914600e+09
11     67.582417650000  373.10  3.138643869500e+09
12    836.815740000000  371.05  3.138644683350e+09
13   2158.665170000000  371.05  3.138644648500e+09
14   1869.031330000000  371.05  3.138644160600e+09

### 3. 비교연산자 또한 같으며 결과가 boolean 타입으로 반환된다.
 * gt 외에도 여러가지 비교 연산자를 제공한다.
  >  * eq() : ==
  >  * ne() : !=
  >  * it() : <
  >  * gt() : >
  >  * le() : <=
  >  * ge() : >=

In [49]:
df > df_2
df.gt(df_2)

    amount  price  timestamp
0    False  False      False
1    False  False      False
2    False  False      False
3    False  False      False
4    False  False      False
5    False  False      False
6    False  False      False
7    False  False      False
8    False  False      False
9    False  False      False
10   False  False      False
11   False  False      False
12   False  False      False
13   False  False      False
14   False  False      False

### Boolean Reductions에 대해 알아보자. Reduction는 한글로 축소, 삭감이라는 의미이며, 여러가지 값을 하나의 값으로 축소시킨다는 의미 정도로 이해 할 수 있다.  Reductions 메서드는 empty(), any(), all(), bool()이 있다.


### 4. 먼저, 180보다 큰 값이 있는지 비교 한 후 any()를 호출하면 각 칼럼에 대해 불린 값이 반환된다. any()는 칼럼 값 중 180보다 큰 값이 하나 이상 인 경우 True를 반환하며 0개인 경우 False를 반환된다.

In [52]:
(df > 180).any()

amount       True
price        True
timestamp    True
dtype: bool

### 5. all()인 경우 모든 칼럽의 값이 180보다 큰 경우  True를 반환하고, 아니면 False를 반환한다.

In [54]:
(df > 181).all()

amount       False
price        False
timestamp     True
dtype: bool

### 6. empty는 데이터프레임의 모든 칼럼값이 비어 있는지 여부를 반환한다. 아무 값이 없는 데이터프레임을 생선하면 True를 반환한다.

In [60]:
df.empty

False

### 7. 아무값이없는 데이터프레임을 생성한다면 True를 반환한다.

In [62]:
pd.DataFrame(columns=list('ABC')).empty

True